<h1>기초 데이터 관리</h1><br>

리더쉽에 관한 조사결과<br>
성별에 따라 매니저의 리더쉽이 관계있나?<br>
국적도 중요한 요인인가?<br>
질문에 대한 평점은 1~5까지 설정<br>

In [42]:
manager <- c(1,2,3,4,5)
date<-c('10/24/14','10/28/14','10/01/14','10/12/14','05/01/14')
country<-c('US','US','UK','UK','UK')
gender<-c('M','F','F','M','F')
age<-c(32,45,25,39,99)
q1<-c(5,3,3,3,2)
q2<-c(4,5,5,3,2)
q3<-c(5,2,5,4,1)
q4<-c(5,5,5,NA,2)
q5<-c(5,5,2,NA,1)
leadership<-data.frame(manager, date, country, gender, age, q1,q2,q3,q4,q5, stringsAsFactors = F)
leadership

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/14 US      M      32  5  4  5   5  5
2 2       10/28/14 US      F      45  3  5  2   5  5
3 3       10/01/14 UK      F      25  3  5  5   5  2
4 4       10/12/14 UK      M      39  3  3  4  NA NA
5 5       05/01/14 UK      F      99  2  2  1   2  1

<h4>1)새로운 속성(컬럼) 추가: 다섯개의 평점을 결합</h4><br>
데이터 프레임에 새로운 열을 추가하려면 <br>
$연산자를 사용하거나 transform()함수를 이용한다<br>

In [7]:
mydata<-data.frame(x1=c(2,2,6,4),
                   x2=c(3,4,2,8))
mydata

  x1 x2
1 2  3
2 2  4
3 6  2
4 4  8

sumx <- x1+x2     #총합 <br>
meanx <-(x1+x2)/2 #평균 <br>

sumx <- mydata$x1+mydata$x1     #총합 <br>
meanx <-(mydata$x1+mydata$x1)/2 #평균 <br>

데이터프레임에 새로운 열 추가 : $

In [14]:
mydata$sum <-mydata$x1+mydata$x2
mydata$meanx <-(mydata$x1+mydata$x2)/2
mydata

  x1 x2 sum meanx sumx
1 2  3   5  2.5    5
2 2  4   6  3.0    6
3 6  2   8  4.0    8
4 4  8  12  6.0   12

새로운 열 추가: attach/detach 사용<br>

In [16]:
attach(mydata)
mydata$sumx<-x1+x2
mydata$meanx <- (x1+x2)/2
detach(mydata)
mydata

  x1 x2 sum meanx sumx
1 2  3   5  2.5    5
2 2  4   6  3.0    6
3 6  2   8  4.0    8
4 4  8  12  6.0   12

새로운 열 추가: transform

In [17]:
mydata <-transform(mydata,
                   sumx=x1+x2,
                   meanx =(x1+x2)/2)
mydata

  x1 x2 sum meanx sumx
1 2  3   5  2.5    5
2 2  4   6  3.0    6
3 6  2   8  4.0    8
4 4  8  12  6.0   12

<h4>2)변수(컬럼)값 재작성</h4><br>
기존의 변수나 값을 기준으로 새로운 변수값을 생성<br>
연속값을 가진 변수를 3개의 카테고리로 나눔 <br>
잘못 작성된 값을 바른 값으로 대체 <br>
조건에 따라 통과/탈락 변수 생성<br>

In [43]:
leadership$age_cate[leadership$age==25]<-'청년 '
leadership$age_cate[leadership$age==32]<-'불혹 '
leadership$age_cate[leadership$age==39]<-'불혹 '
leadership$age_cate[leadership$age==45]<-'지천명 '
leadership$age_cate[leadership$age==99]<-'백수 '
leadership

  manager date     country gender age q1 q2 q3 q4 q5 age_cate
1 1       10/24/14 US      M      32  5  4  5   5  5 불혹
2 2       10/28/14 US      F      45  3  5  2   5  5 지천명
3 3       10/01/14 UK      F      25  3  5  5   5  2 청년
4 4       10/12/14 UK      M      39  3  3  4  NA NA 불혹
5 5       05/01/14 UK      F      99  2  2  1   2  1 백수

within을 이용해서 간결하게 작성

In [44]:
leadership <-within(leadership,{
  age_cate[age==99]<-'백수'
  age_cate[age<99]<-'졸수'
  age_cate[age<90]<-'산수'
  age_cate[age<80]<-'고희'
  age_cate[age<70]<-'이순'
  age_cate[age<60]<-'지천명'
  age_cate[age<50]<-'불혹'
  age_cate[age<40]<-'청년'
  age_cate[age<30]<-'약관'
  })
leadership

  manager date     country gender age q1 q2 q3 q4 q5 age_cate
1 1       10/24/14 US      M      32  5  4  5   5  5 청년
2 2       10/28/14 US      F      45  3  5  2   5  5 불혹
3 3       10/01/14 UK      F      25  3  5  5   5  2 약관
4 4       10/12/14 UK      M      39  3  3  4  NA NA 청년
5 5       05/01/14 UK      F      99  2  2  1   2  1 백수

<h4>3)컬럼명 변경 - 변수명이 맘에 안든다면 바꾸자! </h4>

In [45]:
fix(leadership) 
leadership

  manager date     country gender age q1 q2 q3 q4 q5 age_cate
1 1       10/24/14 US      M      32  5  4  5   5  5 청년
2 2       10/28/14 US      F      45  3  5  2   5  5 불혹
3 3       10/01/14 UK      F      25  3  5  5   5  2 약관
4 4       10/12/14 UK      M      39  3  3  4  NA NA 청년
5 5       05/01/14 UK      F      99  2  2  1   2  1 백수

In [55]:
names(leadership) 
names(leadership)[2] <-'newDate'

names(leadership)[1:5]<-c('c1','c2','c3','c4','c5')
leadership

 [1] "managerID" "examDate"  "nation"    "gender"    "age"       "q1"
 [7] "q2"        "q3"        "q4"        "q5"        "age_cate"

  c1 c2       c3 c4 c5 q1 q2 q3 q4 q5 age_cate
1 1  10/24/14 US M  32 5  4  5   5  5 청년
2 2  10/28/14 US F  45 3  5  2   5  5 불혹
3 3  10/01/14 UK F  25 3  5  5   5  2 약관
4 4  10/12/14 UK M  39 3  3  4  NA NA 청년
5 5  05/01/14 UK F  99 2  2  1   2  1 백수

plyr 패키지를 이용해서 이름을 바꿔보자 : rename

In [48]:
#install.packages('plyr')
#library('plyr') 
#이미 설치됐다면 재설치할 필요가 없음

In [56]:
leadership<-rename(leadership,c(c1='managerID',c2='examDate',c3='nation',c4='gender',c5='age'))
leadership

  managerID examDate nation gender age q1 q2 q3 q4 q5 age_cate
1 1         10/24/14 US     M      32  5  4  5   5  5 청년
2 2         10/28/14 US     F      45  3  5  2   5  5 불혹
3 3         10/01/14 UK     F      25  3  5  5   5  2 약관
4 4         10/12/14 UK     M      39  3  3  4  NA NA 청년
5 5         05/01/14 UK     F      99  2  2  1   2  1 백수

<h4>4)결측값(누락된 값) 처리</h4><br>
누락, 오류, 부적절한 데이터를 보완 -NA <br>
is.na()는 누락값 여부 확인<br>

In [58]:
x<-c(1,2,3,NA)
is.na(x)         
is.na(leadership[,6:10])

[1] FALSE FALSE FALSE  TRUE

  q1    q2    q3    q4    q5
1 FALSE FALSE FALSE FALSE FALSE
2 FALSE FALSE FALSE FALSE FALSE
3 FALSE FALSE FALSE FALSE FALSE
4 FALSE FALSE FALSE  TRUE  TRUE
5 FALSE FALSE FALSE FALSE FALSE

누락값은 비교불가능 -> 비교연산자 사용불가<br>
분석에서 누락값은 제외하는 것이 좋음

In [60]:
y <-x[1]+x[2]+x[3]+x[4] #NA가 포함된 벡터에 산술연산을 하면?
z<-sum(x)

In [62]:
#na.rm=T를 사용해서 누락값 제외
z<-sum(x,na.rm=T)
z

[1] 6

In [64]:
#NA가 있는 관측치를 아예 제거 - na.omit()
na.omit(leadership)
leadership

  managerID examDate nation gender age q1 q2 q3 q4 q5 age_cate
1 1         10/24/14 US     M      32  5  4  5  5  5  청년
2 2         10/28/14 US     F      45  3  5  2  5  5  불혹
3 3         10/01/14 UK     F      25  3  5  5  5  2  약관
5 5         05/01/14 UK     F      99  2  2  1  2  1  백수

  managerID examDate nation gender age q1 q2 q3 q4 q5 age_cate
1 1         10/24/14 US     M      32  5  4  5   5  5 청년
2 2         10/28/14 US     F      45  3  5  2   5  5 불혹
3 3         10/01/14 UK     F      25  3  5  5   5  2 약관
4 4         10/12/14 UK     M      39  3  3  4  NA NA 청년
5 5         05/01/14 UK     F      99  2  2  1   2  1 백수

<h4>5)날짜 데이터 다루기</h4><br>
현재 날짜/시간 출력 - Sys.Date(), Sys.Time() <br>
날짜 데이터를 입력할때는 보통 문자형식을 사용 <br>
경우에 따라 날짜로 검색하거나 계산해야 할 필요가 존재 <br>
따라서, 문자형식을 날짜 형식으로 변환해야 함 - as.Date() <br> 
as.Date() : 기본형식은 yyyy-mm-dd <br>

In [66]:
Sys.Date()
Sys.time()

[1] "2018-03-23"

[1] "2018-03-23 11:03:47 KST"

In [68]:
mydate<-c('2007-10-05','2018-03-01')
class(mydate)
mydates<-as.Date(mydate)
class(mydates)
mydates

[1] "character"

[1] "Date"

[1] "2007-10-05" "2018-03-01"

In [69]:
#기본형식이 아닌 다른 형식의 날짜 데이터는
#형식 지정자를 사용해서 변환 해야 함
mydate <-c('01/05/2016','08/16/1975')
mydate
mydates <-as.Date(mydate,'%m/%d/%y')
mydates

[1] "01/05/2016" "08/16/1975"

[1] "2020-01-05" "2019-08-16"

In [74]:
fmt <- '%m/%d/%y'

In [78]:
leadership

  managerID examDate nation gender age q1 q2 q3 q4 q5 age_cate
1 1         10/24/14 US     M      32  5  4  5   5  5 청년
2 2         10/28/14 US     F      45  3  5  2   5  5 불혹
3 3         10/01/14 UK     F      25  3  5  5   5  2 약관
4 4         10/12/14 UK     M      39  3  3  4  NA NA 청년
5 5         05/01/14 UK     F      99  2  2  1   2  1 백수

In [80]:
#날짜 변환- format() 형식지정자 %m %d %y
today<-Sys.Date()
format(today,format='%B,%d,%Y,%y')
format(today,format='%A %a %d')

[1] "3월,23,2018,18"

[1] "금요일 금 23"

In [82]:
#날짜계산
sdate <-as.Date('1993-03-25')
edate<-as.Date('2018-03-01')
mydays<-edate-sdate
mydays

difftime(edate,sdate)
difftime(edate,sdate,units='weeks')
difftime(edate,sdate,units='hours')
difftime(edate,sdate,units='mins')

Time difference of 9107 days

Time difference of 9107 days

Time difference of 1301 weeks

Time difference of 218568 hours

Time difference of 13114080 mins

In [84]:
#형변환
#as.numeric() : is.numeric()
#as.character() : is.character()
#as.logical() : is.logical()
#as.vector() : is.vector()
#날짜를 문자로 변환- as.Character()
strDate<-as.character(edate)
a<-c(1,2,3)
is.numeric(a)
is.vector(a)

a<-as.character(a)
is.numeric(a)
is.character(a)

[1] TRUE

[1] TRUE

[1] FALSE

[1] TRUE

In [86]:
#데이터정렬 -order()
leadership[order(leadership$age),]
leadership[order(leadership$gender,leadership$age),]
leadership[order(leadership$gender,-leadership$age),]

  managerID examDate nation gender age q1 q2 q3 q4 q5 age_cate
3 3         10/01/14 UK     F      25  3  5  5   5  2 약관
1 1         10/24/14 US     M      32  5  4  5   5  5 청년
4 4         10/12/14 UK     M      39  3  3  4  NA NA 청년
2 2         10/28/14 US     F      45  3  5  2   5  5 불혹
5 5         05/01/14 UK     F      99  2  2  1   2  1 백수

  managerID examDate nation gender age q1 q2 q3 q4 q5 age_cate
3 3         10/01/14 UK     F      25  3  5  5   5  2 약관
2 2         10/28/14 US     F      45  3  5  2   5  5 불혹
5 5         05/01/14 UK     F      99  2  2  1   2  1 백수
1 1         10/24/14 US     M      32  5  4  5   5  5 청년
4 4         10/12/14 UK     M      39  3  3  4  NA NA 청년

  managerID examDate nation gender age q1 q2 q3 q4 q5 age_cate
5 5         05/01/14 UK     F      99  2  2  1   2  1 백수
2 2         10/28/14 US     F      45  3  5  2   5  5 불혹
3 3         10/01/14 UK     F      25  3  5  5   5  2 약관
4 4         10/12/14 UK     M      39  3  3  4  NA NA 청년
1 1         10/24/14 US     M      32  5  4  5   5  5 청년

In [91]:
#문자열 이어붙이기 :paste
myvars<-paste('q',1:5,sep='') #q1,q2,q3,q4,q5
newdata<-leadership[myvars]
paste('hello','world','!!')
paste('hello','world','!!',sep='')
paste('hello','world','!!',sep='-')

[1] "hello world !!"

[1] "helloworld!!"

[1] "hello-world-!!"

In [93]:
#변수 제외하기 : !, -, NULL
myvars<-names(leadership) %in% c('q3','q4')

In [95]:
#%in% : R의 특수 연산자 - 특정값 포함 여부 검사 
myvars

 [1] FALSE FALSE FALSE FALSE FALSE FALSE FALSE  TRUE  TRUE FALSE FALSE

In [96]:
newdata<-leadership[myvars]   #TRUE인 열만 출력
newdata<-leadership[!myvars]

newdata<-leadership[c(8,9)]   #8, 9열 출력
newdata<-leadership[c(-8,-9)] #8,9열만 제외하고 출력 
newdata

leadership$q3 <-leadership$q4 <-NULL 
leadership

  managerID examDate nation gender age q1 q2 q5 age_cate
1 1         10/24/14 US     M      32  5  4   5 청년
2 2         10/28/14 US     F      45  3  5   5 불혹
3 3         10/01/14 UK     F      25  3  5   2 약관
4 4         10/12/14 UK     M      39  3  3  NA 청년
5 5         05/01/14 UK     F      99  2  2   1 백수

  managerID examDate nation gender age q1 q2 q5 age_cate
1 1         10/24/14 US     M      32  5  4   5 청년
2 2         10/28/14 US     F      45  3  5   5 불혹
3 3         10/01/14 UK     F      25  3  5   2 약관
4 4         10/12/14 UK     M      39  3  3  NA 청년
5 5         05/01/14 UK     F      99  2  2   1 백수

In [98]:
#관측치를 검색 후 선택
newdata <-leadership[1:3,]  #1,2,3행 출력
newdata

  managerID examDate nation gender age q1 q2 q5 age_cate
1 1         10/24/14 US     M      32  5  4  5  청년
2 2         10/28/14 US     F      45  3  5  5  불혹
3 3         10/01/14 UK     F      25  3  5  2  약관

<h4>6)데이터를 SQL처럼 사용하자! -sqldf</h4>

In [ ]:
install.packages('sqldf')
library(sqldf)

remove.packages('RMySQL')
detach('RMySQL', unload=T)
detach('sqldf',unload=T)

In [ ]:
iris #붓꽃 3가지 종류에 대해 꽃받침, 꽃잎길이 정리 
sqldf('select * from iris')

In [ ]:
#붓꽃 종을 출력 - 중복배제 
sqldf('select distinct Species from iris')
unique(iris$Species)
iris[!duplicated(iris$Species),]

In [ ]:
install.packages('plyr')
library(plyr)

install.packages("dplyr")
library("dplyr")

In [108]:
sql<-'select count(Species) from iris where "Petal.Width">0.5'
sqldf(sql)

sql<-'select species,avg("sepal.Length") as sum from iris group by species'
sqldf(sql)

  count(Species)
1 101

  Species    sum
1 setosa     5.006
2 versicolor 5.936
3 virginica  6.588

In [111]:
#구글에서 제공하는 데이터집합 - Fruits
install.packages('googleVis')
library(googleVis)

sqldf('select * from Fruits')
sqldf('select * from Fruits where Fruit = "Apples"')
sqldf('select * from Fruits limit 3')
sqldf('select * from Fruits order by Year')
sqldf('select sum(Sales), max(Sales) from Fruits')
sqldf('select Fruit, avg(Sales) from Fruits group by Fruit')
Fruits

Warning message:
"package 'googleVis' is in use and will not be installed"

  Fruit   Year Location Sales Expenses Profit Date
1 Apples  2008 West      98   78       20     2008-12-31
2 Apples  2009 West     111   79       32     2009-12-31
3 Apples  2010 West      89   76       13     2010-12-31
4 Oranges 2008 East      96   81       15     2008-12-31
5 Bananas 2008 East      85   76        9     2008-12-31
6 Oranges 2009 East      93   80       13     2009-12-31
7 Bananas 2009 East      94   78       16     2009-12-31
8 Oranges 2010 East      98   91        7     2010-12-31
9 Bananas 2010 East      81   71       10     2010-12-31

  Fruit  Year Location Sales Expenses Profit Date
1 Apples 2008 West      98   78       20     2008-12-31
2 Apples 2009 West     111   79       32     2009-12-31
3 Apples 2010 West      89   76       13     2010-12-31

  Fruit  Year Location Sales Expenses Profit Date
1 Apples 2008 West      98   78       20     2008-12-31
2 Apples 2009 West     111   79       32     2009-12-31
3 Apples 2010 West      89   76       13     2010-12-31

  Fruit   Year Location Sales Expenses Profit Date
1 Apples  2008 West      98   78       20     2008-12-31
2 Oranges 2008 East      96   81       15     2008-12-31
3 Bananas 2008 East      85   76        9     2008-12-31
4 Apples  2009 West     111   79       32     2009-12-31
5 Oranges 2009 East      93   80       13     2009-12-31
6 Bananas 2009 East      94   78       16     2009-12-31
7 Apples  2010 West      89   76       13     2010-12-31
8 Oranges 2010 East      98   91        7     2010-12-31
9 Bananas 2010 East      81   71       10     2010-12-31

  sum(Sales) max(Sales)
1 845        111

  Fruit   avg(Sales)
1 Apples  99.33333
2 Bananas 86.66667
3 Oranges 95.66667

  Fruit   Year Location Sales Expenses Profit Date
1 Apples  2008 West      98   78       20     2008-12-31
2 Apples  2009 West     111   79       32     2009-12-31
3 Apples  2010 West      89   76       13     2010-12-31
4 Oranges 2008 East      96   81       15     2008-12-31
5 Bananas 2008 East      85   76        9     2008-12-31
6 Oranges 2009 East      93   80       13     2009-12-31
7 Bananas 2009 East      94   78       16     2009-12-31
8 Oranges 2010 East      98   91        7     2010-12-31
9 Bananas 2010 East      81   71       10     2010-12-31

In [113]:
mtcars

                    mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Mazda RX4           21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag       21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
Datsun 710          22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive      21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout   18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2
Valiant             18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1
Duster 360          14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4
Merc 240D           24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2
Merc 230            22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
Merc 280            19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4
Merc 280C           17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4
Merc 450SE          16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3
Merc 450SL          17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3
Merc 450SLC         15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3
Cadillac Fleetwood  10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4
Lincoln Continental 10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4
Chrysler Imperial   14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4
Fiat 128            32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
Honda Civic         30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
Toyota Corolla      33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1
Toyota Corona       21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1
Dodge Challenger    15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2
AMC Javelin         15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2
Camaro Z28          13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4
Pontiac Firebird    19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2
Fiat X1-9           27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
Porsche 914-2       26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2
Lotus Europa        30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
Ford Pantera L      15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4
Ferrari Dino        19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6
Maserati Bora       15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8
Volvo 142E          21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2

In [115]:
sqldf('select * from mtcars')
sqldf('select * from mtcars where mpg = "21.0"')
sqldf('select * from mtcars limit 3')
sqldf('select * from mtcars order by mpg')
sqldf('select sum(mpg), max(mpg) from mtcars')
sqldf('select mpg, disp from mtcars group by mpg')

   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
1  21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
2  21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
3  22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
4  21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
5  18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2
6  18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1
7  14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4
8  24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2
9  22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
10 19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4
11 17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4
12 16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3
13 17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3
14 15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3
15 10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4
16 10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4
17 14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4
18 32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
19 30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
20 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1
21 21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1
22 15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2
23 15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2
24 13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4
25 19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2
26 27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
27 26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2
28 30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
29 15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4
30 19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6
31 15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8
32 21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2

  mpg cyl disp hp  drat wt    qsec  vs am gear carb
1 21  6   160  110 3.9  2.620 16.46 0  1  4    4
2 21  6   160  110 3.9  2.875 17.02 0  1  4    4

  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
2 21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
3 22.8 4   108   93 3.85 2.320 18.61 1  1  4    1

   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
1  10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4
2  10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4
3  13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4
4  14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4
5  14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4
6  15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8
7  15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3
8  15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2
9  15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2
10 15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4
11 16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3
12 17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3
13 17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4
14 18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1
15 18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2
16 19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4
17 19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2
18 19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6
19 21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
20 21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
21 21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
22 21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2
23 21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1
24 22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
25 22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
26 24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2
27 26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2
28 27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
29 30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
30 30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
31 32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
32 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1

  sum(mpg) max(mpg)
1 642.9    33.9

   mpg  disp
1  10.4 460.0
2  13.3 350.0
3  14.3 360.0
4  14.7 440.0
5  15.0 301.0
6  15.2 304.0
7  15.5 318.0
8  15.8 351.0
9  16.4 275.8
10 17.3 275.8
11 17.8 167.6
12 18.1 225.0
13 18.7 360.0
14 19.2 400.0
15 19.7 145.0
16 21.0 160.0
17 21.4 121.0
18 21.5 120.1
19 22.8 140.8
20 24.4 146.7
21 26.0 120.3
22 27.3  79.0
23 30.4  95.1
24 32.4  78.7
25 33.9  71.1